MikroElektronika/core_packages/PIC/XC8/def/PIC18F25Q43/mcu.h
#define DIA_MUI                                             0x2C0000
#define DIA_MUI0                                            0x2C0000
#define DIA_MUI1                                            0x2C0002
#define DIA_MUI2                                            0x2C0004
#define DIA_MUI3                                            0x2C0006
#define DIA_MUI4                                            0x2C0008
#define DIA_MUI5                                            0x2C000A
#define DIA_MUI6                                            0x2C000C
#define DIA_MUI7                                            0x2C000E
#define DIA_MUI8                                            0x2C0010
#define DIA_MUI9                                            0x2C0012

#define DIA_EUI                                             0x2C0014
#define DIA_EUI0                                            0x2C0014
#define DIA_EUI1                                            0x2C0016
#define DIA_EUI2                                            0x2C0018
#define DIA_EUI3                                            0x2C001A
#define DIA_EUI4                                            0x2C001C
#define DIA_EUI5                                            0x2C001E
#define DIA_EUI6                                            0x2C0020
#define DIA_EUI7                                            0x2C0022

#define DIA_TSLR                                            0x2C0024
#define DIA_TSLR1                                           0x2C0024
#define DIA_TSLR2                                           0x2C0026
#define DIA_TSLR3                                           0x2C0028

#define DIA_TSHR                                            0x2C002A
#define DIA_TSHR1                                           0x2C002A
#define DIA_TSHR2                                           0x2C002C
#define DIA_TSHR3                                           0x2C002E

#define DIA_FVRA                                            0x2C0030
#define DIA_FVRA1X                                          0x2C0030
#define DIA_FVRA2X                                          0x2C0032
#define DIA_FVRA4X                                          0x2C0034

#define DIA_FVRC                                            0x2C0036
#define DIA_FVRC1X                                          0x2C0036
#define DIA_FVRC2X                                          0x2C0038
#define DIA_FVRC4X                                          0x2C003A

/*
 * Device Configuration Information (DCI) Table
 */

#define DCI_ERSIZ                                           0x3C0000
#define DCI_WLSIZ                                           0x3C0002
#define DCI_URSIZ                                           0x3C0004
#define DCI_EESIZ                                           0x3C0006
#define DCI_PCNT                                            0x3C0008

/*
 * Register Definitions
 */

// Register: CLKRCON
#define CLKRCON CLKRCON
extern volatile unsigned char           CLKRCON             __at(0x039);
#ifndef _LIB_BUILD
asm("CLKRCON equ 039h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DIV                    :3;
        unsigned DC                     :2;
        unsigned                        :2;
        unsigned EN                     :1;
    };
    struct {
        unsigned CLKRDIV0               :1;
        unsigned CLKRDIV1               :1;
        unsigned CLKRDIV2               :1;
        unsigned CLKRDC0                :1;
        unsigned CLKRDC1                :1;
        unsigned                        :2;
        unsigned CLKREN                 :1;
    };
    struct {
        unsigned DIV0                   :1;
        unsigned DIV1                   :1;
        unsigned DIV2                   :1;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
} CLKRCONbits_t;
extern volatile CLKRCONbits_t CLKRCONbits __at(0x039);
// bitfield macros
#define _CLKRCON_DIV_POSN                                   0x0
#define _CLKRCON_DIV_POSITION                               0x0
#define _CLKRCON_DIV_SIZE                                   0x3
#define _CLKRCON_DIV_LENGTH                                 0x3
#define _CLKRCON_DIV_MASK                                   0x7
#define _CLKRCON_DC_POSN                                    0x3
#define _CLKRCON_DC_POSITION                                0x3
#define _CLKRCON_DC_SIZE                                    0x2
#define _CLKRCON_DC_LENGTH                                  0x2
#define _CLKRCON_DC_MASK                                    0x18
#define _CLKRCON_EN_POSN                                    0x7
#define _CLKRCON_EN_POSITION                                0x7
#define _CLKRCON_EN_SIZE                                    0x1
#define _CLKRCON_EN_LENGTH                                  0x1
#define _CLKRCON_EN_MASK                                    0x80
#define _CLKRCON_CLKRDIV0_POSN                              0x0
#define _CLKRCON_CLKRDIV0_POSITION                          0x0
#define _CLKRCON_CLKRDIV0_SIZE                              0x1
#define _CLKRCON_CLKRDIV0_LENGTH                            0x1
#define _CLKRCON_CLKRDIV0_MASK                              0x1
#define _CLKRCON_CLKRDIV1_POSN                              0x1
#define _CLKRCON_CLKRDIV1_POSITION                          0x1
#define _CLKRCON_CLKRDIV1_SIZE                              0x1
#define _CLKRCON_CLKRDIV1_LENGTH                            0x1
#define _CLKRCON_CLKRDIV1_MASK                              0x2
#define _CLKRCON_CLKRDIV2_POSN                              0x2
#define _CLKRCON_CLKRDIV2_POSITION                          0x2
#define _CLKRCON_CLKRDIV2_SIZE                              0x1
#define _CLKRCON_CLKRDIV2_LENGTH                            0x1
#define _CLKRCON_CLKRDIV2_MASK                              0x4
#define _CLKRCON_CLKRDC0_POSN                               0x3
#define _CLKRCON_CLKRDC0_POSITION                           0x3
#define _CLKRCON_CLKRDC0_SIZE                               0x1
#define _CLKRCON_CLKRDC0_LENGTH                             0x1
#define _CLKRCON_CLKRDC0_MASK                               0x8
#define _CLKRCON_CLKRDC1_POSN                               0x4
#define _CLKRCON_CLKRDC1_POSITION                           0x4
#define _CLKRCON_CLKRDC1_SIZE                               0x1
#define _CLKRCON_CLKRDC1_LENGTH                             0x1
#define _CLKRCON_CLKRDC1_MASK                               0x10
#define _CLKRCON_CLKREN_POSN                                0x7
#define _CLKRCON_CLKREN_POSITION                            0x7
#define _CLKRCON_CLKREN_SIZE                                0x1
#define _CLKRCON_CLKREN_LENGTH                              0x1
#define _CLKRCON_CLKREN_MASK                                0x80
#define _CLKRCON_DIV0_POSN                                  0x0
#define _CLKRCON_DIV0_POSITION                              0x0
#define _CLKRCON_DIV0_SIZE                                  0x1
#define _CLKRCON_DIV0_LENGTH                                0x1
#define _CLKRCON_DIV0_MASK                                  0x1
#define _CLKRCON_DIV1_POSN                                  0x1
#define _CLKRCON_DIV1_POSITION                              0x1
#define _CLKRCON_DIV1_SIZE                                  0x1
#define _CLKRCON_DIV1_LENGTH                                0x1
#define _CLKRCON_DIV1_MASK                                  0x2
#define _CLKRCON_DIV2_POSN                                  0x2
#define _CLKRCON_DIV2_POSITION                              0x2
#define _CLKRCON_DIV2_SIZE                                  0x1
#define _CLKRCON_DIV2_LENGTH                                0x1
#define _CLKRCON_DIV2_MASK                                  0x4
#define _CLKRCON_DC0_POSN                                   0x3
#define _CLKRCON_DC0_POSITION                               0x3
#define _CLKRCON_DC0_SIZE                                   0x1
#define _CLKRCON_DC0_LENGTH                                 0x1
#define _CLKRCON_DC0_MASK                                   0x8
#define _CLKRCON_DC1_POSN                                   0x4
#define _CLKRCON_DC1_POSITION                               0x4
#define _CLKRCON_DC1_SIZE                                   0x1
#define _CLKRCON_DC1_LENGTH                                 0x1
#define _CLKRCON_DC1_MASK                                   0x10

