MikroElektronika/core_packages/PIC/XC8/def/PIC18F25Q43/mcu.h
extern volatile PR1bits_t PR1bits __at(0x321);
// bitfield macros
#define _PR1_CS_POSN                                        0x0
#define _PR1_CS_POSITION                                    0x0
#define _PR1_CS_SIZE                                        0x8
#define _PR1_CS_LENGTH                                      0x8
#define _PR1_CS_MASK                                        0xFF
#define _PR1_T1CS0_POSN                                     0x0
#define _PR1_T1CS0_POSITION                                 0x0
#define _PR1_T1CS0_SIZE                                     0x1
#define _PR1_T1CS0_LENGTH                                   0x1
#define _PR1_T1CS0_MASK                                     0x1
#define _PR1_T1CS1_POSN                                     0x1
#define _PR1_T1CS1_POSITION                                 0x1
#define _PR1_T1CS1_SIZE                                     0x1
#define _PR1_T1CS1_LENGTH                                   0x1
#define _PR1_T1CS1_MASK                                     0x2
#define _PR1_T1CS2_POSN                                     0x2
#define _PR1_T1CS2_POSITION                                 0x2
#define _PR1_T1CS2_SIZE                                     0x1
#define _PR1_T1CS2_LENGTH                                   0x1
#define _PR1_T1CS2_MASK                                     0x4
#define _PR1_T1CS3_POSN                                     0x3
#define _PR1_T1CS3_POSITION                                 0x3
#define _PR1_T1CS3_SIZE                                     0x1
#define _PR1_T1CS3_LENGTH                                   0x1
#define _PR1_T1CS3_MASK                                     0x8
#define _PR1_T1CS4_POSN                                     0x4
#define _PR1_T1CS4_POSITION                                 0x4
#define _PR1_T1CS4_SIZE                                     0x1
#define _PR1_T1CS4_LENGTH                                   0x1
#define _PR1_T1CS4_MASK                                     0x10
#define _PR1_CS0_POSN                                       0x0
#define _PR1_CS0_POSITION                                   0x0
#define _PR1_CS0_SIZE                                       0x1
#define _PR1_CS0_LENGTH                                     0x1
#define _PR1_CS0_MASK                                       0x1
#define _PR1_CS1_POSN                                       0x1
#define _PR1_CS1_POSITION                                   0x1
#define _PR1_CS1_SIZE                                       0x1
#define _PR1_CS1_LENGTH                                     0x1
#define _PR1_CS1_MASK                                       0x2
#define _PR1_CS2_POSN                                       0x2
#define _PR1_CS2_POSITION                                   0x2
#define _PR1_CS2_SIZE                                       0x1
#define _PR1_CS2_LENGTH                                     0x1
#define _PR1_CS2_MASK                                       0x4
#define _PR1_CS3_POSN                                       0x3
#define _PR1_CS3_POSITION                                   0x3
#define _PR1_CS3_SIZE                                       0x1
#define _PR1_CS3_LENGTH                                     0x1
#define _PR1_CS3_MASK                                       0x8
#define _PR1_CS4_POSN                                       0x4
#define _PR1_CS4_POSITION                                   0x4
#define _PR1_CS4_SIZE                                       0x1
#define _PR1_CS4_LENGTH                                     0x1
#define _PR1_CS4_MASK                                       0x10

// Register: T2TMR
#define T2TMR T2TMR
extern volatile unsigned char           T2TMR               __at(0x322);
#ifndef _LIB_BUILD
asm("T2TMR equ 0322h");
#endif
// aliases
extern volatile unsigned char           TMR2                __at(0x322);
#ifndef _LIB_BUILD
asm("TMR2 equ 0322h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR2                   :8;
    };
} T2TMRbits_t;
extern volatile T2TMRbits_t T2TMRbits __at(0x322);
// bitfield macros
#define _T2TMR_TMR2_POSN                                    0x0
#define _T2TMR_TMR2_POSITION                                0x0
#define _T2TMR_TMR2_SIZE                                    0x8
#define _T2TMR_TMR2_LENGTH                                  0x8
#define _T2TMR_TMR2_MASK                                    0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR2                   :8;
    };
} TMR2bits_t;
extern volatile TMR2bits_t TMR2bits __at(0x322);
// bitfield macros
#define _TMR2_TMR2_POSN                                     0x0
#define _TMR2_TMR2_POSITION                                 0x0
#define _TMR2_TMR2_SIZE                                     0x8
#define _TMR2_TMR2_LENGTH                                   0x8
#define _TMR2_TMR2_MASK                                     0xFF

// Register: T2PR
#define T2PR T2PR
extern volatile unsigned char           T2PR                __at(0x323);
#ifndef _LIB_BUILD
asm("T2PR equ 0323h");
#endif
// aliases
extern volatile unsigned char           _PR2                 __at(0x323);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR2 equ 0323h");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned _PR2                    :8;  // Note: Changed by MikroE
    };
} T2PRbits_t;
extern volatile T2PRbits_t T2PRbits __at(0x323);
// bitfield macros
#define _T2PR_PR2_POSN                                      0x0
#define _T2PR_PR2_POSITION                                  0x0
#define _T2PR_PR2_SIZE                                      0x8
#define _T2PR_PR2_LENGTH                                    0x8
#define _T2PR_PR2_MASK                                      0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned _PR2                    :8;  // Note: Changed by MikroE
    };
} PR2bits_t;
extern volatile PR2bits_t PR2bits __at(0x323);
// bitfield macros
#define _PR2_PR2_POSN                                       0x0
#define _PR2_PR2_POSITION                                   0x0
#define _PR2_PR2_SIZE                                       0x8
#define _PR2_PR2_LENGTH                                     0x8
#define _PR2_PR2_MASK                                       0xFF

// Register: T2CON
#define T2CON T2CON
extern volatile unsigned char           T2CON               __at(0x324);
#ifndef _LIB_BUILD
asm("T2CON equ 0324h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUTPS                  :4;
        unsigned CKPS                   :3;
        unsigned ON                     :1;
    };
    struct {
        unsigned T2OUTPS                :4;
        unsigned T2CKPS                 :3;
        unsigned T2ON                   :1;
    };
    struct {
        unsigned T2OUTPS0               :1;
        unsigned T2OUTPS1               :1;
        unsigned T2OUTPS2               :1;
        unsigned T2OUTPS3               :1;
        unsigned T2CKPS0                :1;
        unsigned T2CKPS1                :1;
        unsigned T2CKPS2                :1;
    };
    struct {
        unsigned OUTPS0                 :1;
        unsigned OUTPS1                 :1;
        unsigned OUTPS2                 :1;
        unsigned OUTPS3                 :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CKPS2                  :1;
        unsigned TMR2ON                 :1;
    };
} T2CONbits_t;
