MikroElektronika/core_packages/PIC/XC8/def/PIC18F25Q43/mcu.h
extern volatile T4CLKbits_t T4CLKbits __at(0x332);
// bitfield macros
#define _T4CLK_CS_POSN                                      0x0
#define _T4CLK_CS_POSITION                                  0x0
#define _T4CLK_CS_SIZE                                      0x8
#define _T4CLK_CS_LENGTH                                    0x8
#define _T4CLK_CS_MASK                                      0xFF
#define _T4CLK_CS0_POSN                                     0x0
#define _T4CLK_CS0_POSITION                                 0x0
#define _T4CLK_CS0_SIZE                                     0x1
#define _T4CLK_CS0_LENGTH                                   0x1
#define _T4CLK_CS0_MASK                                     0x1
#define _T4CLK_CS1_POSN                                     0x1
#define _T4CLK_CS1_POSITION                                 0x1
#define _T4CLK_CS1_SIZE                                     0x1
#define _T4CLK_CS1_LENGTH                                   0x1
#define _T4CLK_CS1_MASK                                     0x2
#define _T4CLK_CS2_POSN                                     0x2
#define _T4CLK_CS2_POSITION                                 0x2
#define _T4CLK_CS2_SIZE                                     0x1
#define _T4CLK_CS2_LENGTH                                   0x1
#define _T4CLK_CS2_MASK                                     0x4
#define _T4CLK_CS3_POSN                                     0x3
#define _T4CLK_CS3_POSITION                                 0x3
#define _T4CLK_CS3_SIZE                                     0x1
#define _T4CLK_CS3_LENGTH                                   0x1
#define _T4CLK_CS3_MASK                                     0x8
#define _T4CLK_CS4_POSN                                     0x4
#define _T4CLK_CS4_POSITION                                 0x4
#define _T4CLK_CS4_SIZE                                     0x1
#define _T4CLK_CS4_LENGTH                                   0x1
#define _T4CLK_CS4_MASK                                     0x10
#define _T4CLK_CS5_POSN                                     0x5
#define _T4CLK_CS5_POSITION                                 0x5
#define _T4CLK_CS5_SIZE                                     0x1
#define _T4CLK_CS5_LENGTH                                   0x1
#define _T4CLK_CS5_MASK                                     0x20
#define _T4CLK_T4CS_POSN                                    0x0
#define _T4CLK_T4CS_POSITION                                0x0
#define _T4CLK_T4CS_SIZE                                    0x8
#define _T4CLK_T4CS_LENGTH                                  0x8
#define _T4CLK_T4CS_MASK                                    0xFF
#define _T4CLK_T4CS0_POSN                                   0x0
#define _T4CLK_T4CS0_POSITION                               0x0
#define _T4CLK_T4CS0_SIZE                                   0x1
#define _T4CLK_T4CS0_LENGTH                                 0x1
#define _T4CLK_T4CS0_MASK                                   0x1
#define _T4CLK_T4CS1_POSN                                   0x1
#define _T4CLK_T4CS1_POSITION                               0x1
#define _T4CLK_T4CS1_SIZE                                   0x1
#define _T4CLK_T4CS1_LENGTH                                 0x1
#define _T4CLK_T4CS1_MASK                                   0x2
#define _T4CLK_T4CS2_POSN                                   0x2
#define _T4CLK_T4CS2_POSITION                               0x2
#define _T4CLK_T4CS2_SIZE                                   0x1
#define _T4CLK_T4CS2_LENGTH                                 0x1
#define _T4CLK_T4CS2_MASK                                   0x4
#define _T4CLK_T4CS3_POSN                                   0x3
#define _T4CLK_T4CS3_POSITION                               0x3
#define _T4CLK_T4CS3_SIZE                                   0x1
#define _T4CLK_T4CS3_LENGTH                                 0x1
#define _T4CLK_T4CS3_MASK                                   0x8
#define _T4CLK_T4CS4_POSN                                   0x4
#define _T4CLK_T4CS4_POSITION                               0x4
#define _T4CLK_T4CS4_SIZE                                   0x1
#define _T4CLK_T4CS4_LENGTH                                 0x1
#define _T4CLK_T4CS4_MASK                                   0x10
#define _T4CLK_T4CS5_POSN                                   0x5
#define _T4CLK_T4CS5_POSITION                               0x5
#define _T4CLK_T4CS5_SIZE                                   0x1
#define _T4CLK_T4CS5_LENGTH                                 0x1
#define _T4CLK_T4CS5_MASK                                   0x20

// Register: T4RST
#define T4RST T4RST
extern volatile unsigned char           T4RST               __at(0x333);
#ifndef _LIB_BUILD
asm("T4RST equ 0333h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSEL                   :8;
    };
    struct {
        unsigned RSEL0                  :1;
        unsigned RSEL1                  :1;
        unsigned RSEL2                  :1;
        unsigned RSEL3                  :1;
        unsigned RSEL4                  :1;
        unsigned RSEL5                  :1;
        unsigned RSEL6                  :1;
    };
    struct {
        unsigned T4RSEL                 :8;
    };
    struct {
        unsigned T4RSEL0                :1;
        unsigned T4RSEL1                :1;
        unsigned T4RSEL2                :1;
        unsigned T4RSEL3                :1;
        unsigned T4RSEL4                :1;
        unsigned T4RSEL5                :1;
        unsigned T4RSEL6                :1;
    };
} T4RSTbits_t;
extern volatile T4RSTbits_t T4RSTbits __at(0x333);
// bitfield macros
#define _T4RST_RSEL_POSN                                    0x0
#define _T4RST_RSEL_POSITION                                0x0
#define _T4RST_RSEL_SIZE                                    0x8
#define _T4RST_RSEL_LENGTH                                  0x8
#define _T4RST_RSEL_MASK                                    0xFF
#define _T4RST_RSEL0_POSN                                   0x0
#define _T4RST_RSEL0_POSITION                               0x0
#define _T4RST_RSEL0_SIZE                                   0x1
#define _T4RST_RSEL0_LENGTH                                 0x1
#define _T4RST_RSEL0_MASK                                   0x1
#define _T4RST_RSEL1_POSN                                   0x1
#define _T4RST_RSEL1_POSITION                               0x1
#define _T4RST_RSEL1_SIZE                                   0x1
#define _T4RST_RSEL1_LENGTH                                 0x1
#define _T4RST_RSEL1_MASK                                   0x2
#define _T4RST_RSEL2_POSN                                   0x2
#define _T4RST_RSEL2_POSITION                               0x2
#define _T4RST_RSEL2_SIZE                                   0x1
#define _T4RST_RSEL2_LENGTH                                 0x1
#define _T4RST_RSEL2_MASK                                   0x4
#define _T4RST_RSEL3_POSN                                   0x3
#define _T4RST_RSEL3_POSITION                               0x3
#define _T4RST_RSEL3_SIZE                                   0x1
#define _T4RST_RSEL3_LENGTH                                 0x1
#define _T4RST_RSEL3_MASK                                   0x8
#define _T4RST_RSEL4_POSN                                   0x4
#define _T4RST_RSEL4_POSITION                               0x4
#define _T4RST_RSEL4_SIZE                                   0x1
#define _T4RST_RSEL4_LENGTH                                 0x1
#define _T4RST_RSEL4_MASK                                   0x10
#define _T4RST_RSEL5_POSN                                   0x5
#define _T4RST_RSEL5_POSITION                               0x5
#define _T4RST_RSEL5_SIZE                                   0x1
#define _T4RST_RSEL5_LENGTH                                 0x1
#define _T4RST_RSEL5_MASK                                   0x20
#define _T4RST_RSEL6_POSN                                   0x6
#define _T4RST_RSEL6_POSITION                               0x6
#define _T4RST_RSEL6_SIZE                                   0x1
#define _T4RST_RSEL6_LENGTH                                 0x1
#define _T4RST_RSEL6_MASK                                   0x40
#define _T4RST_T4RSEL_POSN                                  0x0
#define _T4RST_T4RSEL_POSITION                              0x0
#define _T4RST_T4RSEL_SIZE                                  0x8
#define _T4RST_T4RSEL_LENGTH                                0x8
#define _T4RST_T4RSEL_MASK                                  0xFF
#define _T4RST_T4RSEL0_POSN                                 0x0
#define _T4RST_T4RSEL0_POSITION                             0x0
#define _T4RST_T4RSEL0_SIZE                                 0x1
#define _T4RST_T4RSEL0_LENGTH                               0x1
#define _T4RST_T4RSEL0_MASK                                 0x1
#define _T4RST_T4RSEL1_POSN                                 0x1
#define _T4RST_T4RSEL1_POSITION                             0x1
#define _T4RST_T4RSEL1_SIZE                                 0x1
#define _T4RST_T4RSEL1_LENGTH                               0x1
#define _T4RST_T4RSEL1_MASK                                 0x2
#define _T4RST_T4RSEL2_POSN                                 0x2
#define _T4RST_T4RSEL2_POSITION                             0x2
#define _T4RST_T4RSEL2_SIZE                                 0x1
#define _T4RST_T4RSEL2_LENGTH                               0x1
#define _T4RST_T4RSEL2_MASK                                 0x4
#define _T4RST_T4RSEL3_POSN                                 0x3
#define _T4RST_T4RSEL3_POSITION                             0x3
#define _T4RST_T4RSEL3_SIZE                                 0x1
#define _T4RST_T4RSEL3_LENGTH                               0x1
#define _T4RST_T4RSEL3_MASK                                 0x8
#define _T4RST_T4RSEL4_POSN                                 0x4
#define _T4RST_T4RSEL4_POSITION                             0x4
#define _T4RST_T4RSEL4_SIZE                                 0x1
#define _T4RST_T4RSEL4_LENGTH                               0x1
#define _T4RST_T4RSEL4_MASK                                 0x10
#define _T4RST_T4RSEL5_POSN                                 0x5
#define _T4RST_T4RSEL5_POSITION                             0x5
#define _T4RST_T4RSEL5_SIZE                                 0x1
#define _T4RST_T4RSEL5_LENGTH                               0x1
#define _T4RST_T4RSEL5_MASK                                 0x20
#define _T4RST_T4RSEL6_POSN                                 0x6
#define _T4RST_T4RSEL6_POSITION                             0x6
#define _T4RST_T4RSEL6_SIZE                                 0x1
#define _T4RST_T4RSEL6_LENGTH                               0x1
#define _T4RST_T4RSEL6_MASK                                 0x40

// Register: TMR5
#define TMR5 TMR5
extern volatile unsigned short          TMR5                __at(0x334);
#ifndef _LIB_BUILD
asm("TMR5 equ 0334h");
#endif

// Register: TMR5L
#define TMR5L TMR5L
extern volatile unsigned char           TMR5L               __at(0x334);
#ifndef _LIB_BUILD
asm("TMR5L equ 0334h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR5L                  :8;
    };
    struct {
        unsigned TMR5L0                 :1;
        unsigned TMR5L1                 :1;
        unsigned TMR5L2                 :1;
        unsigned TMR5L3                 :1;
        unsigned TMR5L4                 :1;
        unsigned TMR5L5                 :1;
        unsigned TMR5L6                 :1;
        unsigned TMR5L7                 :1;
    };
    struct {
        unsigned TMR50                  :1;
        unsigned TMR51                  :1;
        unsigned TMR52                  :1;
        unsigned TMR53                  :1;
        unsigned TMR54                  :1;
        unsigned TMR55                  :1;
        unsigned TMR56                  :1;
        unsigned TMR57                  :1;
    };
} TMR5Lbits_t;
extern volatile TMR5Lbits_t TMR5Lbits __at(0x334);
// bitfield macros
#define _TMR5L_TMR5L_POSN                                   0x0
#define _TMR5L_TMR5L_POSITION                               0x0
#define _TMR5L_TMR5L_SIZE                                   0x8
#define _TMR5L_TMR5L_LENGTH                                 0x8
#define _TMR5L_TMR5L_MASK                                   0xFF
#define _TMR5L_TMR5L0_POSN                                  0x0
#define _TMR5L_TMR5L0_POSITION                              0x0
#define _TMR5L_TMR5L0_SIZE                                  0x1
#define _TMR5L_TMR5L0_LENGTH                                0x1
#define _TMR5L_TMR5L0_MASK                                  0x1
#define _TMR5L_TMR5L1_POSN                                  0x1
#define _TMR5L_TMR5L1_POSITION                              0x1
#define _TMR5L_TMR5L1_SIZE                                  0x1
#define _TMR5L_TMR5L1_LENGTH                                0x1
#define _TMR5L_TMR5L1_MASK                                  0x2
#define _TMR5L_TMR5L2_POSN                                  0x2
#define _TMR5L_TMR5L2_POSITION                              0x2
#define _TMR5L_TMR5L2_SIZE                                  0x1
#define _TMR5L_TMR5L2_LENGTH                                0x1
#define _TMR5L_TMR5L2_MASK                                  0x4
#define _TMR5L_TMR5L3_POSN                                  0x3
#define _TMR5L_TMR5L3_POSITION                              0x3
#define _TMR5L_TMR5L3_SIZE                                  0x1
#define _TMR5L_TMR5L3_LENGTH                                0x1
#define _TMR5L_TMR5L3_MASK                                  0x8
#define _TMR5L_TMR5L4_POSN                                  0x4
#define _TMR5L_TMR5L4_POSITION                              0x4
#define _TMR5L_TMR5L4_SIZE                                  0x1
#define _TMR5L_TMR5L4_LENGTH                                0x1
#define _TMR5L_TMR5L4_MASK                                  0x10
#define _TMR5L_TMR5L5_POSN                                  0x5
#define _TMR5L_TMR5L5_POSITION                              0x5
#define _TMR5L_TMR5L5_SIZE                                  0x1
#define _TMR5L_TMR5L5_LENGTH                                0x1
#define _TMR5L_TMR5L5_MASK                                  0x20
#define _TMR5L_TMR5L6_POSN                                  0x6
#define _TMR5L_TMR5L6_POSITION                              0x6
#define _TMR5L_TMR5L6_SIZE                                  0x1
#define _TMR5L_TMR5L6_LENGTH                                0x1
#define _TMR5L_TMR5L6_MASK                                  0x40
#define _TMR5L_TMR5L7_POSN                                  0x7
#define _TMR5L_TMR5L7_POSITION                              0x7
#define _TMR5L_TMR5L7_SIZE                                  0x1
#define _TMR5L_TMR5L7_LENGTH                                0x1
#define _TMR5L_TMR5L7_MASK                                  0x80
#define _TMR5L_TMR50_POSN                                   0x0
#define _TMR5L_TMR50_POSITION                               0x0
#define _TMR5L_TMR50_SIZE                                   0x1
#define _TMR5L_TMR50_LENGTH                                 0x1
#define _TMR5L_TMR50_MASK                                   0x1
#define _TMR5L_TMR51_POSN                                   0x1
#define _TMR5L_TMR51_POSITION                               0x1
#define _TMR5L_TMR51_SIZE                                   0x1
#define _TMR5L_TMR51_LENGTH                                 0x1
#define _TMR5L_TMR51_MASK                                   0x2
#define _TMR5L_TMR52_POSN                                   0x2
#define _TMR5L_TMR52_POSITION                               0x2
#define _TMR5L_TMR52_SIZE                                   0x1
#define _TMR5L_TMR52_LENGTH                                 0x1
#define _TMR5L_TMR52_MASK                                   0x4
#define _TMR5L_TMR53_POSN                                   0x3
#define _TMR5L_TMR53_POSITION                               0x3
#define _TMR5L_TMR53_SIZE                                   0x1
#define _TMR5L_TMR53_LENGTH                                 0x1
#define _TMR5L_TMR53_MASK                                   0x8
#define _TMR5L_TMR54_POSN                                   0x4
#define _TMR5L_TMR54_POSITION                               0x4
#define _TMR5L_TMR54_SIZE                                   0x1
#define _TMR5L_TMR54_LENGTH                                 0x1
#define _TMR5L_TMR54_MASK                                   0x10
#define _TMR5L_TMR55_POSN                                   0x5
#define _TMR5L_TMR55_POSITION                               0x5
#define _TMR5L_TMR55_SIZE                                   0x1
#define _TMR5L_TMR55_LENGTH                                 0x1
#define _TMR5L_TMR55_MASK                                   0x20
#define _TMR5L_TMR56_POSN                                   0x6
#define _TMR5L_TMR56_POSITION                               0x6
#define _TMR5L_TMR56_SIZE                                   0x1
#define _TMR5L_TMR56_LENGTH                                 0x1
#define _TMR5L_TMR56_MASK                                   0x40
#define _TMR5L_TMR57_POSN                                   0x7
#define _TMR5L_TMR57_POSITION                               0x7
#define _TMR5L_TMR57_SIZE                                   0x1
#define _TMR5L_TMR57_LENGTH                                 0x1
#define _TMR5L_TMR57_MASK                                   0x80

// Register: TMR5H
#define TMR5H TMR5H
extern volatile unsigned char           TMR5H               __at(0x335);
#ifndef _LIB_BUILD
asm("TMR5H equ 0335h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR5H                  :8;
    };
    struct {
        unsigned TMR5H0                 :1;
        unsigned TMR5H1                 :1;
        unsigned TMR5H2                 :1;
        unsigned TMR5H3                 :1;
        unsigned TMR5H4                 :1;
        unsigned TMR5H5                 :1;
        unsigned TMR5H6                 :1;
        unsigned TMR5H7                 :1;
    };
    struct {
        unsigned TMR58                  :1;
        unsigned TMR59                  :1;
        unsigned TMR510                 :1;
        unsigned TMR511                 :1;
        unsigned TMR512                 :1;
        unsigned TMR513                 :1;
        unsigned TMR514                 :1;
        unsigned TMR515                 :1;
    };
} TMR5Hbits_t;
